# -*- coding: utf-8 -*-
'''
Задание 5.1a

Всё, как в задании 5.1. Но, если пользователь ввел адрес хоста, а не адрес сети,
то надо адрес хоста преобразовать в адрес сети и вывести адрес сети и маску, как в задании 5.1.

Пример адреса сети (все биты хостовой части равны нулю):
* 10.0.1.0/24
* 190.1.0.0/16

Пример адреса хоста:
* 10.0.1.1/24 - хост из сети 10.0.1.0/24
* 10.0.5.1/30 - хост из сети 10.0.5.0/30

Если пользователь ввел адрес 10.0.1.1/24,
вывод должен быть таким:

Network:
10        0         1         0
00001010  00000000  00000001  00000000

Mask:
/24
255       255       255       0
11111111  11111111  11111111  00000000

Проверить работу скрипта на разных комбинациях сеть/маска.

Ограничение: Все задания надо выполнять используя только пройденные темы.

'''
prefix = input('введите IP-сеть: ')

mask = int(prefix.split('/')[1])

list_dec_IP = [int(i) for i in prefix.split('/')[0].split('.')]
list_bin_IP = ['{0:08b}'.format(i) for i in list_dec_IP]

seq_bin_net = ''.join(list_bin_IP)[:mask] + '0' * (32 - mask)
list_bin_net = [seq_bin_net[i:i+8] for i in range(0,32,8)]
list_dec_net = [int(i,2) for i in list_bin_net]

seq_bin_mask = '1' * mask + '0' * (32 - mask)
list_bin_mask = [seq_bin_mask[i:i+8] for i in range(0,32,8)]
list_dec_mask = [int(i,2) for i in list_bin_mask]

print('''Network:
{0:<10}{1:<10}{2:<10}{3:<10}
{0:08b}  {1:08b}  {2:08b}  {3:08b}

Mask:
/{4}'''.format(*list_dec_net, mask))
print('{0:<10}{1:<10}{2:<10}{3:<10}'.format(*list_dec_mask))
print('{0:08b}  {1:08b}  {2:08b}  {3:08b}'.format(*list_dec_mask))
